# StairsSupporttypeFlipSectionProfile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupporttypeFlipSectionProfile Property
ParameterTypeId Class See Also
---
"Flip Section Profile": Flip Section Profile
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupporttypeFlipSectionProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupporttypeFlipSectionProfile As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupporttypeFlipSectionProfile {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace